backend/artillery.yaml
config:
  target: http://localhost:3000
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm Up
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp Up
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike
  plugins: 
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
    fake-data: {}
  apdex:
    threshold: 500
  ensure:
    threshold: 
      - http.response_time.p99: 500
      - http.response_time.p95: 300
  fake-data:
    incrementalNumber:
      start: 1900
      end: 3000
      step: 2
    randNumber:
      min: 0
      max: 100
    randFloat:
      min: 0
      max: 300
      fractionDigits: 2
scenarios:
  - name: 'Test post endpoint'
    flow:
      - post:
          url: "/api/v1/"
          json:
            year: "{{ $incrementalNumber() }}"
            temperature: "{{ $randNumber() }}"
            humidity: "{{ $randNumber() }}"
            rainfall: "{{ $randFloat() }}"
  - flow:
      - get:
          url: "/api/v1/visualize"
  - flow:
      - get:
          url: "/api/v1/summary"